#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>
#include <dirent.h>
#include <string.h>

int main(void) {
    // ########################################
    // ########################################
    // fd: 파일 디스크립터 번호를 저장하는 변수
    // n : R/W가 진행된 byte를 담고 있는 변수
    // buf : R/W를 위해 자료를 임시적으로 담은 버퍼
    // ########################################
    // ########################################
    int fd, n;
    DIR *dp;
    char buf[BUFSIZ];
    
    // ########################################
    // ########################################
    // DIR *opendir(const char *dirname);
    // Input: 디렉토리 경로
    // Output: 
    //     - (성공시) DIR 포인터
    //     - (실패시) NULL
    // ----------------------------------------
    // [개요] 현재 프로그램이 위치한 디렉토리 열기
    // ########################################
    // ########################################
    if ((dp = opendir(".")) == NULL) {
        perror("opendir error");
        exit(1);
    }

    // ########################################
    // ########################################
    // struct dirent *readdir(DIR *dirp);
    // Input: 디렉토리 포인터
    // Output: 
    //     - DIR 엔트리
    // ----------------------------------------
    // [개요]
    // dir을 계속 순회하면서 entry를 살펴본다.
    // data.txt가 감지되면 다음 절차로 넘어간다.
    // ########################################
    // ########################################
    struct dirent *dent;
    int flag = 1;
    while (1) {
        while ((dent = readdir(dp))) {
            if (!strcmp(dent->d_name, "data.txt")) {
                flag = 0;
                break;
            }
        }
        if (flag) {
            rewinddir(dp);
        } else {
            break;
        }
    }
    
    // ########################################
    // ########################################
    // [개요]
    // 파일에 기반한 프로세스 통신이 수행된다.
    // ########################################
    // ########################################
    fd = open("data.txt", O_CREAT);
    if (fd == -1) {
        perror("Open data.txt");
        exit(1);
    }

    // ########################################
    // ########################################
    // [개요]
    // 파일에 기반한 프로세스 통신이 수행된다.
    // ########################################
    // ########################################
    while (1) {
        n = read(fd, buf, 255);
        buf[n] = '\0';
        if (n == -1) {
            perror("Read error");
        } else if (n == 0) {
            continue;
        }
        write(1, "Recv>> ", 7);
        write(1, buf, n);
        if (n == 1 && buf[0] == 'q') {
            write(1, "Terminate\n", 10);
            break;
        }
    }

    // ########################################
    // ########################################
    // [개요]
    // 프로그램이 종료되면 파일디스크립터 사용을
    // 해제한다.
    // ########################################
    // ########################################
    close(fd);
    closedir(dp);

    return 0;
}